<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Lesson-Structure" data-toc-modified-id="Lesson-Structure-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Lesson Structure</a></span><ul class="toc-item"><li><span><a href="#Questions" data-toc-modified-id="Questions-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Questions</a></span></li><li><span><a href="#Outcomes" data-toc-modified-id="Outcomes-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Outcomes</a></span></li><li><span><a href="#Objectives" data-toc-modified-id="Objectives-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Objectives</a></span></li><li><span><a href="#Outline" data-toc-modified-id="Outline-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Outline</a></span></li></ul></li><li><span><a href="#(5-min)-Warm-Up" data-toc-modified-id="(5-min)-Warm-Up-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>(5 min) Warm Up</a></span></li><li><span><a href="#Demonstrating-SQLite-&amp;-Python" data-toc-modified-id="Demonstrating-SQLite-&amp;-Python-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Demonstrating SQLite &amp; Python</a></span><ul class="toc-item"><li><span><a href="#Connecting-to-our-sqlite-db-using-sqlite3" data-toc-modified-id="Connecting-to-our-sqlite-db-using-sqlite3-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Connecting to our sqlite db using sqlite3</a></span></li><li><span><a href="#Listing-the-tables-in-our-db" data-toc-modified-id="Listing-the-tables-in-our-db-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Listing the tables in our db</a></span></li><li><span><a href="#Now--select-everything-from-the-employees-table-just-to-get-a-feel-for-it" data-toc-modified-id="Now--select-everything-from-the-employees-table-just-to-get-a-feel-for-it-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Now  select everything from the employees table just to get a feel for it</a></span></li><li><span><a href="#Now-let's-load-this-into-a-dataframe-using-the-.read_sql-method,-we'll-use-some-of-the-same-components-from-above." data-toc-modified-id="Now-let's-load-this-into-a-dataframe-using-the-.read_sql-method,-we'll-use-some-of-the-same-components-from-above.-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Now let's load this into a dataframe using the <code>.read_sql</code> method, we'll use some of the same components from above.</a></span></li><li><span><a href="#(3-min)-What-are-the-pros-and-cons-of-loading-a-sql-query-into-a-dataframe?" data-toc-modified-id="(3-min)-What-are-the-pros-and-cons-of-loading-a-sql-query-into-a-dataframe?-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>(3 min) What are the pros and cons of loading a sql query into a dataframe?</a></span></li><li><span><a href="#A-throwback-favorite" data-toc-modified-id="A-throwback-favorite-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>A throwback favorite</a></span></li><li><span><a href="#WHY-SHOULD-YOU-ALWAYS-SPECIFY-YOUR-PRIMARY-KEYS!?" data-toc-modified-id="WHY-SHOULD-YOU-ALWAYS-SPECIFY-YOUR-PRIMARY-KEYS!?-3.7"><span class="toc-item-num">3.7&nbsp;&nbsp;</span>WHY SHOULD YOU ALWAYS SPECIFY YOUR PRIMARY KEYS!?</a></span></li></ul></li><li><span><a href="#Exercises" data-toc-modified-id="Exercises-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exercises</a></span><ul class="toc-item"><li><span><a href="#Query-Exercise-1" data-toc-modified-id="Query-Exercise-1-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Query Exercise 1</a></span></li><li><span><a href="#Query-Exercise-2" data-toc-modified-id="Query-Exercise-2-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Query Exercise 2</a></span></li><li><span><a href="#Query-Exercise-3" data-toc-modified-id="Query-Exercise-3-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Query Exercise 3</a></span></li><li><span><a href="#Query-Exercise-4" data-toc-modified-id="Query-Exercise-4-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Query Exercise 4</a></span></li><li><span><a href="#Query-Exercise-5" data-toc-modified-id="Query-Exercise-5-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Query Exercise 5</a></span></li><li><span><a href="#Great!-It's-working.-Let's-add-some-group-by-to-remove-duplicates!" data-toc-modified-id="Great!-It's-working.-Let's-add-some-group-by-to-remove-duplicates!-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>Great! It's working. Let's add some group by to remove duplicates!</a></span></li></ul></li></ul></div>

### What did we learn?
* pandas is pretty memory heavy
* get table names from sqlite_master
* break down your joins into 2 parts each time

# Lesson Structure

## Questions
*

## Outcomes

YWBAT
- perform a query that is ordered by a value
- load query results as a dataframe
- build functions to perform queries
- execute a query using multiple joins

## Objectives

- write an order by query on a given table
- convert the customers table to a dataframe using pandas and sqlite3
- compare and contrast using a dataframe vs using the results as a list, from a query
- write a single join query
- write a multiple join query

## Outline

* Take Questions
* Warm Up
* Connect to our sqlite db
* Compare and contrast reading a query as a list vs reading a query as a dataframe
* Practice various queries
* Complete a Join Query
* Complete a query using multiple Joins
* wrap up

# (5 min) Warm Up

Given the following 'Employees' table, write a query that completes the following task.  Send your query to me in a private chat here in zoom.

Expected Result:
- IdNum, LName, FName and Salary
- Order it by salary, starting with the highest salary

<img src="images/table.png" width=500 align="center">

<details>
    <summary>Solution</summary>
    
```SQL
SELECT IdNum, LName, FName, Salary
FROM Employees
ORDER BY Salary DESC
```
</details>

# Demonstrating SQLite & Python

In [1]:
import pandas as pd
import numpy as np

import sqlite3

import matplotlib.pyplot as plt

## Connecting to our sqlite db using sqlite3

In [2]:
conn = sqlite3.connect('data.sqlite')
cursor = conn.cursor()

## Listing the tables in our db

In [3]:
# table_names to be a list of my table_names
query = "SELECT name FROM sqlite_master WHERE type='table';"
res = cursor.execute(query).fetchall()
print(res) # Notice these are tuples, let's extract only the names in the next cell

[('orderdetails',), ('payments',), ('offices',), ('customers',), ('orders',), ('productlines',), ('products',), ('employees',), ('contacts',), ('contacts2',)]

In [5]:
table_names = [r[0] for r in res]
print(table_names)

['orderdetails', 'payments', 'offices', 'customers', 'orders', 'productlines', 'products', 'employees', 'contacts', 'contacts2']

## Now  select everything from the employees table just to get a feel for it

In [6]:
query = 'select * from employees;'
res = cursor.execute(query).fetchall()
res[:2] 

# what does this return? 
# it's a list
# it's a list of tuples
# it's a list of tuples of strings

[('1002',
  'Murphy',
  'Diane',
  'x5800',
  'dmurphy@classicmodelcars.com',
  '1',
  '',
  'President'),
 ('1056',
  'Patterson',
  'Mary',
  'x4611',
  'mpatterso@classicmodelcars.com',
  '1',
  '1002',
  'VP Sales')]

## Now let's load this into a dataframe using the `.read_sql` method, we'll use some of the same components from above.

In [7]:
query = 'select * from employees;'
df = pd.read_sql(query, conn)
df.head() # Much better and more readable!

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 8 columns):
employeeNumber    23 non-null object
lastName          23 non-null object
firstName         23 non-null object
extension         23 non-null object
email             23 non-null object
officeCode        23 non-null object
reportsTo         23 non-null object
jobTitle          23 non-null object
dtypes: object(8)
memory usage: 1.6+ KB

In [12]:
import sys
sys.getsizeof(res), sys.getsizeof(df)

(264, 12297)

## (3 min) What are the pros and cons of loading a sql query into a dataframe?
- Pros
    - easier to read, we get the columns
    - easier to export into a file (csv, json, etc)
    - easier to write functions, because we can slice our dataframe easier
    - pandas has a lot of built in methods to do analysis and manipulation
- Cons
    - slower (probably) since pandas has to load that data into a dataframe
    - easier to make a mistake if connection isn't setup properly
    - pandas is memory heavy

In [13]:
def load_df(table_name, conn):
    query = f"select * from {table_name}"
    df = pd.read_sql(query, conn)
    return df

## A throwback favorite

In [18]:
table_dict = {}
for table_name in table_names:
    df = load_df(table_name, conn)
    table_dict[table_name] = df

In [21]:
table_dict['payments']

    customerNumber checkNumber paymentDate    amount
0              103    HQ336336  2004-10-19   6066.78
1              103    JM555205  2003-06-05  14571.44
2              103    OM314933  2004-12-18   1676.14
3              112    BO864823  2004-12-17  14191.12
4              112     HQ55022  2003-06-06  32641.98
..             ...         ...         ...       ...
268            495    BH167026  2003-12-26  59265.14
269            495    FN155234  2004-05-14   6276.60
270            496    EU531600  2005-05-25  30253.75
271            496    MB342426  2003-07-16  32077.44
272            496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]

## WHY SHOULD YOU ALWAYS SPECIFY YOUR PRIMARY KEYS!?
* primary keys should be unique to each row
* primary keys usually are used in joins

In [22]:
query = 'pragma table_info("employees");'
cursor.execute(query).fetchall()

[(0, 'employeeNumber', '', 0, None, 0),
 (1, 'lastName', '', 0, None, 0),
 (2, 'firstName', '', 0, None, 0),
 (3, 'extension', '', 0, None, 0),
 (4, 'email', '', 0, None, 0),
 (5, 'officeCode', '', 0, None, 0),
 (6, 'reportsTo', '', 0, None, 0),
 (7, 'jobTitle', '', 0, None, 0)]

[Discussion here]

# Exercises

## Query Exercise 1

Create the following table using the customers table and the orders table

<img src="images/query1.png" width="500"/>

In [23]:
# First look at the customers dataframe 
query = "select * from {}"
customers = pd.read_sql(query.format("customers"), conn)
orders = pd.read_sql(query.format("orders"), conn)

# Then look at the orders dataframe
customers.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",,Nantes,,44000,France,1370,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700.00

In [24]:
orders.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,,141

<details>
    <summary>Query 1 - Solution</summary>
    
```python
    query = """
    SELECT c.customerName, c.phone, c.state, o.orderDate FROM
    customers as c
    JOIN orders as o using (customerNumber);
    """
```
</details>

In [38]:
query = """SELECT c.customername, c.phone, c.state, o.orderdate
           FROM customers as c
           JOIN orders as o
           USING (customernumber);
        """

In [39]:
join_1 = pd.read_sql(query, conn)
join_1.head()

         customerName       phone state   orderDate
0   Atelier graphique  40.32.2555        2003-05-20
1   Atelier graphique  40.32.2555        2004-09-27
2   Atelier graphique  40.32.2555        2004-11-25
3  Signal Gift Stores  7025551838    NV  2003-05-21
4  Signal Gift Stores  7025551838    NV  2004-08-06

## Query Exercise 2

Create a query that results in a table with the every customer number for an employee along with the employee name and number.

Ex:

<img src="images/query2.png" width="500"/>

In [44]:
# Work here
display(employees_table.head())
display(customers.head())

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",,Nantes,,44000,France,1370,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700.00

In [45]:
query = """
        SELECT e.firstname, e.lastname, e.employeenumber, c.customernumber
        FROM employees as e
        JOIN customers as c
        ON e.employeeNumber = c.salesRepEmployeeNumber;
        """

pd.read_sql(query, conn).head()

  firstName  lastName employeeNumber customerNumber
0    Leslie  Jennings           1165            124
1    Leslie  Jennings           1165            129
2    Leslie  Jennings           1165            161
3    Leslie  Jennings           1165            321
4    Leslie  Jennings           1165            450

In [47]:
# how do I count the number of customers an employee has?
query = """
        SELECT e.firstname, e.lastname, e.employeenumber, count(c.customernumber) as totalcustomers
        FROM employees as e
        JOIN customers as c
        ON e.employeeNumber = c.salesRepEmployeeNumber
        GROUP BY e.employeenumber;
        """

pd.read_sql(query, conn).head()

  firstName   lastName employeeNumber  totalcustomers
0    Leslie   Jennings           1165               6
1    Leslie   Thompson           1166               6
2     Julie   Firrelli           1188               6
3     Steve  Patterson           1216               6
4  Foon Yue      Tseng           1286               7

<details>
    <summary> Query 2 - Solution</summary>
    
```python
query = """
    select e.firstname, e.lastname, e.employeenumber, c.customerNumber
    from employees as e
    join customers as c
    on e.employeenumber = c.salesrepemployeenumber;"""
```
    
</details>

In [ ]:
# Now let's take this and incorporate the next table orders
orders_df.head(1)

## Query Exercise 3

Create a query that results in a table with every order number for every customer number for an employee along with the employee name and number.

Ex:

<img src="images/query3.png" width="500"/>

In [48]:
# Work here
display(employees_table.head(2))
display(customers.head(2))
display(orders.head(2))

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128

In [51]:
query = """
        SELECT e.firstname, e.lastname, e.employeenumber, c.customernumber, o.ordernumber
        FROM employees as e
        JOIN customers as c
        ON e.employeenumber = c.salesrepemployeenumber
        JOIN orders as o
        USING (customernumber)
        """

pd.read_sql(query, conn).head()

  firstName  lastName employeeNumber customerNumber orderNumber
0    Leslie  Jennings           1165            124       10113
1    Leslie  Jennings           1165            124       10135
2    Leslie  Jennings           1165            124       10142
3    Leslie  Jennings           1165            124       10182
4    Leslie  Jennings           1165            124       10229

In [54]:
# how do we count the orders for each employee?
query = """
        SELECT e.firstname, e.lastname, e.employeenumber, count(o.ordernumber) as totalOrders
        FROM employees as e
        JOIN customers as c
        ON e.employeenumber = c.salesrepemployeenumber
        JOIN orders as o
        using (customernumber)
        GROUP BY e.employeenumber;
        """

pd.read_sql(query, conn).head()

  firstName   lastName employeeNumber  totalOrders
0    Leslie   Jennings           1165           34
1    Leslie   Thompson           1166           14
2     Julie   Firrelli           1188           14
3     Steve  Patterson           1216           18
4  Foon Yue      Tseng           1286           17

<details>
    <summary> Query 3 - Solution</summary>

```python
query = """
    select e.firstname, e.lastname, e.employeenumber, c.customerNumber, o.orderNumber
    from employees as e
    join customers as c
    on e.employeenumber = c.salesrepemployeenumber
    join orders as o
    on o.customerNumber = c.customerNumber;"""
```
    
</details>

## Query Exercise 4

Write a query that results in the following:

Employee First and Last Name, order number and each product code for that order. 

*There should be a row for each product code*

Screenshot:

<img src="images/query4.png" width="500"/>

In [59]:
products = pd.read_sql("select * from products", conn)
orderdetails = pd.read_sql("select * from orderdetails", conn)

display(employees_table.head(2))
display(customers.head(2))
display(orders.head(2))
display(orderdetails.head(2))

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3
1       10100    S18_2248              50     55.09               2

In [60]:
# work here
query = """
        SELECT e.firstname, e.lastname, od.ordernumber, od.productcode
        FROM employees as e
        JOIN customers as c
        on e.employeenumber = c.salesrepemployeenumber
        JOIN orders as o
        using (customernumber)
        join orderdetails as od
        using (ordernumber)
        """

pd.read_sql(query, conn).head(2)

  firstName  lastName orderNumber productCode
0    Leslie  Jennings       10113    S12_1666
1    Leslie  Jennings       10113    S18_1097

In [61]:
# count products in each order
query = """
        SELECT e.firstname, e.lastname, od.ordernumber, count(od.productcode) as totalproducts
        FROM employees as e
        JOIN customers as c
        on e.employeenumber = c.salesrepemployeenumber
        JOIN orders as o
        using (customernumber)
        join orderdetails as od
        using (ordernumber)
        group by od.ordernumber;
        """

pd.read_sql(query, conn).head(2)

  firstName   lastName orderNumber  totalproducts
0     Steve  Patterson       10100              4
1     Barry      Jones       10101              4

<details>
    <summary>Query 4 Solution</summary>
    
```python
query = """
    select e.firstname, e.lastname, o.orderNumber, od.productCode
    from employees as e
    join customers as c
    on e.employeenumber = c.salesrepemployeenumber
    join orders as o
    on o.customerNumber = c.customerNumber
    join orderdetails as od
    on od.orderNumber = o.orderNumber;"""
    ```
        
</details>

## Query Exercise 5

Write a query that results in the following:

Employee First and Last Name and each product name they sold, add an alias to match the image below

*There should be a row for each product name*

Screenshot:

<img src="images/query5.png" width="500"/>

In [62]:
display(employees_table.head(2))
display(customers.head(2))
display(orders.head(2))
display(orderdetails.head(2))
display(products.head(2))

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3
1       10100    S18_2248              50     55.09               2

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30

In [68]:
# work here
query = """
        select distinct e.firstname as fn, e.lastname as ln, p.productname as pn
        from employees as e
        join customers as c
        on e.employeenumber = c.salesrepemployeenumber
        join orders as e
        using (customernumber)
        join orderdetails as od
        using (ordernumber)
        join products as p
        using (productcode)
        order by fn, ln, pn;
        """

pd.read_sql(query, conn).head(2)

     fn      ln                                   pn
0  Andy  Fixter  18th Century Vintage Horse Carriage
1  Andy  Fixter               1900s Vintage Bi-Plane

<details>
    <summary>Query 5 Solution</summary>
    
```python
query = """
    select distinct e.firstname, e.lastname, p.productName
    from employees as e
    join customers as c
    on e.employeenumber = c.salesrepemployeenumber
    join orders as o
    on o.customerNumber = c.customerNumber
    join orderdetails as od
    on od.orderNumber = o.orderNumber
    join products as p
    on p.productCode = od.productCode;"""
    ```
        
</details>

## Great! It's working. Let's add some group by to remove duplicates!

**Add aliases to result in the following**

<img src="images/query5.png" width="500"/>

In [ ]:
# remember the alias' from above

query = '''SELECT ...'''

final_df = pd.read_sql(query, conn)
final_df.head(2)

<details>
<summary>Final Query Solution</summary>

```python
query = """
        select e.firstname as fn, e.lastname as ln, p.productName as pn
        from employees as e
        join customers as c
        on e.employeenumber = c.salesrepemployeenumber
        join orders as o
        on o.customerNumber = c.customerNumber
        join orderdetails as od
        on od.orderNumber = o.orderNumber
        join products as p
        on p.productCode = od.productCode
        group by fn, ln, pn;"""

```

</details>